WW_LINK = "https://docs.google.com/spreadsheets/d/13KUmHtRXYbXjBE7KQ_4MFQ5VsgUYqu2heURY1y2NwiE/edit#gid=0"
WW_PLACES = {
        "У": "как Управляющий",
        "М": "как Менеджер",
        "РБ": "в ТЦ Рубин",
        "Р": "на Рахова",
        "К": "на Казачьей",
        "Ч": "на Чернышевского",
        "C": "в ТЦ СитиМолл",
        "С": "в ТЦ СитиМолл",
        "И": "как SMM"
    }
replacement_dict = {
    "Магазин Балаково, Ленина 76" : "🛒🅱 Ленина 76",
    "Магазин Саратов, Б. Казачья, 23/27" : "🛒🆂 Б. Казачья 23-27",
    "Магазин Саратов Рахова 149/157" : "🛒🆂 Рахова 149-157",
    "Магазин Саратов ТЦ СитиМолл" :  "🛒🆂 СитиМолл",
    "Магазин-Сервис Саратов, ТЦ Рубин" : "🛒🆂 ТЦ Рубин",
    "Магазин Воронеж, Никитинская, 44"  : "🛒🆅 Никитинская 44",
    "Магазин Воронеж,Центр Галереи Чижова" : "🛒🆅 Галерея Чижова",
    "Магазин Липецк, пр-кт Победы, 74" : "🅻 пр-кт Победы 74",
    "3 Транз Врн - Мск": "📦 Транз Врн ⬅️➡️ Мск",
    "Транзит 5 (Сер-Сер)": "📦 Транзит 5 (Сер-Сер)",
    "1 Транз Сар - Мск": "📦 Транз Сар ⬅️➡️ Мск",
    "Нераспределённый": "📦❓ Нераспределённый",
    "1 Транз Мск - Сар": "📦 Транз Мск ⬅️➡️ Сар",
    "Основной склад Москва": "🏬 Основной склад Москва",
    "Транзитные склады": "🏬 Транзитные склады",
    "2 Транз Мск - Лип": "📦 Транз Мск ⬅️➡️ Лип",
    "3 Транз Мск - Врн": "📦 Транз Мск ⬅️➡️ Врн",
    "4 Транз Сар - Бал": "📦 Транз Сар ⬅️➡️ Бал",
    "4 Транз Бал - Сар": "📦 Транз Бал ⬅️➡️ Сар"
}